# tamil_utils.py

TAMIL_SIGNS = [
    "மேஷம்", "ரிஷபம்", "மிதுனம்", "கடகம்", "சிம்மம்", "கன்னி",
    "துலாம்", "விருச்சிகம்", "தனுசு", "மகரம்", "கும்பம்", "மீனம்"
]

TAMIL_PLANETS = {
    "sun": "சூரியன்",
    "moon": "சந்திரன்",
    "mars": "செவ்வாய்",
    "mercury": "புதன்",
    "jupiter": "குரு",
    "venus": "சுக்ரன்",
    "saturn": "சனி",
    "rahu": "ராகு",
    "ketu": "கேது",
    "uranus": "யுரேனஸ்",
    "neptune": "நெப்டியூன்",
    "pluto": "பிளூட்டோ",
    "lagna": "லக்னம்"
}


LAGNA_LORDS = {
    0: 'Mars', 1: 'Venus', 2: 'Mercury', 3: 'Moon', 4: 'Sun', 5: 'Mercury',
    6: 'Venus', 7: 'Mars', 8: 'Jupiter', 9: 'Saturn', 10: 'Saturn', 11: 'Jupiter'
}

NAKSHATRAS = [
    "அசுவினி", "பரணி", "கிருத்திகை", "ரோஹிணி", "மிருகசீரிடம்", "திருவாதிரை",
    "புனர்பூசம்", "பூசம்", "ஆயில்யம்", "மகம்", "பூரம்", "உத்திரம்",
    "அஸ்தம்", "சித்திரை", "சுவாதி", "விசாகம்", "அனுஷம்", "கேட்டை",
    "மூலம்", "பூராடம்", "உத்திராடம்", "திருஒணம்", "அவிட்டம்", "சதயம்", "பூரட்டாதி", "உத்திரட்டாதி", "ரேவதி"
]
